/**
 * @file task2.cpp
 * @author your name (you@domain.com)
 * @brief 
 * @version 0.1
 * @date 2024-10-09
 * 
 * @copyright Copyright (c) 2024
 * Задача 2:
 * Създайте клас, който описва обекта работник със следните характеристики: социален
 * номер, име, години трудов стаж, текуща длъжност и списък от взимани заплати (тип
 * данни - масив).
 * Забележка: Нивото на достъп до член - променливите да е private.
 * Класът има два конструктора:
 *      Инициализира социалният номер и годините трудов стаж с нулева стойност.
 *      Инициализиране на текуща длъжност да се въведе от клавиатурата.
 * Класът съдържа следните член - функции:
 *      Задаване и получаване на стойности за член-променливите.
 *      За пресмятане на средно аритметичната стойност от заплатите.
 *      За намиране на минимална заплата.
 * Демонстрирайте функционалността на класа чрез създаване на обект в main(). 
 */

#include <iostream>
#include <vector>

class Worker {
private:
    long long socId;
    std::string name;
    int yearsExp;
    std::string position;
    std::vector<Salary> salaries;
public:
    Worker()
    {
        socId = yearsExp = 0;
    }
    Worker(std::string name)
    {
        this->name = name;
        socId = yearsExp = 0;
    }
};
